app/views/items/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <strong>cost : Rs. </strong><%= item.cost %><br>
            <% current = User.find(item.user_id) %>