app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."isSold" = ?  [["isSold", "f"]]
---
  def index
    @items = Item.where(:isSold=>false)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "isSold" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["isSold", "t"], ["updated_at", "2019-01-11 18:07:56.431492"], ["id", 1]]
---
  def Sold
    item = Item.find(params[:id])
    item.update(:isSold => true)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "items" SET "isRequested" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["isRequested", "t"], ["updated_at", "2019-01-12 16:01:59.378315"], ["id", 9]]
---
  def requested
    if !current_user
      redirect_to new_user_session_path , notice: "Log in to request an item"
    end
    item = Item.find(params[:id])
    item.update(:isRequested=>true)

INSERT INTO "items" ("title", "description", "cost", "user_id", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    @item.user_id = current_user.id
    respond_to do |format|
      if @item.save

UPDATE "items" SET "photo_file_name" = ?, "photo_content_type" = ?, "photo_file_size" = ?, "photo_updated_at" = ?, "updated_at" = ? WHERE "items"."id" = ?
---
  def update
    respond_to do |format|
      if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."isSold" = ?  [["user_id", 4], ["isSold", "f"]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."isRequested" = ? AND "items"."isSold" = ?  [["user_id", 1], ["isRequested", "t"], ["isSold", "f"]]
---
  def user_items
    @items = Item.where(:user_id=>current_user.id,:isSold=>false)
    @item = Item.where(:user_id=>current_user.id,:isSold=>true)
    @Reitem = Item.where(:user_id => current_user.id , :isRequested => true,:isSold=>false)